PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

int stabilize(float dt)
{
	struct bmp_data bd;
	struct mpu_data md;
	struct hmc_data hd;
	float lbd, rbd, ltd, rtd;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float gy, gx, gz;

	dt = (dt < 0.000001) ? 0.000001 : dt;

	if (dev[BMP_DEV].status == DEVSTATUS_INIT) {
		dev[BMP_DEV].read(dev[BMP_DEV].priv, 0, &bd,
			sizeof(struct bmp_data));

		dsp_updatelpf(&presslpf, bd.press);
	}

	dev[MPU_DEV].read(dev[MPU_DEV].priv, 0, &md,
		sizeof(struct mpu_data));
	
	dsp_updatelpf(&zlpf, md.afz);

	gy = deg2rad((md.gfy - gy0));
	gx = deg2rad((md.gfx - gx0));
	gz = deg2rad((md.gfz - gz0));

	roll = dsp_updatecompl(&rollcompl, gy * dt,
		atan2f(-md.afx,
		sqrt(md.afy * md.afy + md.afz * md.afz))) - ax0;

	pitch = dsp_updatecompl(&pitchcompl, gx * dt,
		atan2f(md.afy,
		sqrt(md.afx * md.afx + md.afz * md.afz))) - ay0;

	dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
		sizeof(struct hmc_data));

	yaw = circf(hmc_heading(pitch, roll, hd.fx, hd.fy, hd.fz)
		- az0);

	if (speedpid) {
		rollcor = dsp_pid(&rollspv, rolltarget, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchtarget, gx, dt);
	}
	else {
		rollcor = dsp_pid(&rollpv, rolltarget, roll, dt);
		pitchcor = dsp_pid(&pitchpv, pitchtarget, pitch, dt);

		rollcor = dsp_pid(&rollspv, rollcor, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchcor, gx, dt);
	}

	if (yawspeedpid)
		yawcor = dsp_pid(&yawspv, yawtarget, gz, dt);
	else {
		yawcor = circf(dsp_pid(&yawpv, yawtarget, yaw, dt));
		yawcor = dsp_pid(&yawspv, yawcor, gz, dt);
	}

	thrustcor = dsp_pid(&zspv, thrust + 1.0, dsp_getlpf(&zlpf), dt);

	lbd = trimuf(lbw * (thrustcor + 0.5 * rollcor
		- 0.5 * pitchcor + 0.5 * yawcor));
	rbd = trimuf(rbw * (thrustcor - 0.5 * rollcor
		- 0.5 * pitchcor - 0.5 * yawcor));
	ltd = trimuf(ltw * (thrustcor + 0.5 * rollcor
		+ 0.5 * pitchcor - 0.5 * yawcor));
	rtd = trimuf(rtw * (thrustcor - 0.5 * rollcor
		+ 0.5 * pitchcor + 0.5 * yawcor));

	setthrust(ltd, rtd, rbd, lbd);

	return 0;
}

int parsecommand(char **toks, int maxtoks, char *data)
{
	int i;

	i = 0;

	toks[i++] = strtok((char *) data, " ");

	while (i < maxtoks && (toks[i++] = strtok(NULL, " ")) != NULL);

	return (i - 1);
}

int controlcmd(char *cmd)
{
	char *toks[12];
	int tc;

	if (cmd[0] == '\0')
		return 0;

	tc = parsecommand(toks, 12, cmd);

	if (strcmp(toks[0], "beep") == 0) {
		wifitimeout = WIFI_TIMEOUT;

		return 0;
	}
	if (strcmp(toks[0], "md") == 0) {
		struct mpu_data md;
		struct hmc_data hd;
		char s[INFOLEN];

		dev[MPU_DEV].read(dev[MPU_DEV].priv, 0, &md,
			sizeof(struct mpu_data));

		dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
			sizeof(struct hmc_data));
	
		snprintf(s, INFOLEN,
			"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r",
			"accel: ", (double) md.afx, (double) md.afy,
			(double) md.afz);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r",
			"gyro: ", (double) deg2rad(md.gfx - gx0),
			(double) deg2rad(md.gfy - gy0),
			(double) deg2rad(md.gfz - gz0));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"roll: %0.3f; pitch: %0.3f; yaw: %0.3f\n\r",
			(double) (dsp_getcompl(&rollcompl) - ax0),
			(double) (dsp_getcompl(&pitchcompl) - ay0),
			(double) circf(hmc_heading(
				dsp_getcompl(&pitchcompl) - ay0,
				dsp_getcompl(&rollcompl) - ax0,
				hd.fx, hd.fy, hd.fz) - az0));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"z acceleration: %f\r\n",
			(double) dsp_getlpf(&zlpf));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"battery: %0.3f\n\r",
			getadcv(&hadc1) / (double) 0xfff * (double) 6.6);

		esp_send(&espdev, s);
	
		return 0;
	}
	else if (strcmp(toks[0], "hd") == 0) {
		struct hmc_data hd;
		char s[INFOLEN];

		dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
			sizeof(struct hmc_data));
	
		snprintf(s, INFOLEN,
			"x = %0.3f; y = %0.3f; z = %0.3f\n\r",
			(double) hd.fx, (double) hd.fy,
			(double) hd.fz);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"heading: %f\r\n", (double) hmc_heading(
				dsp_getcompl(&pitchcompl) - ay0,
				dsp_getcompl(&rollcompl) - ax0,
				hd.fx, hd.fy, hd.fz));
	
		esp_send(&espdev, s);

		return 0;
	}
	else if (strcmp(toks[0], "bd") == 0) {
		char s[INFOLEN];
		float press;

		press = dsp_getlpf(&presslpf);

		snprintf(s, INFOLEN, "bar: %f; alt: %f\r\n",
			(double) press, (double) getalt(press0, press));
		
		esp_send(&espdev, s);
		
		return 0;
	}
	else if (strcmp(toks[0], "vd") == 0) {
		char s[INFOLEN];
		
		snprintf(s, INFOLEN,
			"t: %.3f; r: %.3f; p: %.3f; y: %.3f\r\n",
			(double) thrust, (double) rolltarget,
			(double) pitchtarget, (double) yawtarget);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"x cor: %.3f; y cor: %.3f; z cor: %.3f\r\n",
			(double) ax0, (double) ay0, (double) az0);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"lbw: %0.1f; rbw: %0.1f; ltw: %0.1f; rtw: %0.1f\r\n",
			(double) lbw, (double) rbw,
			(double) ltw, (double) rtw);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"cf: %.6f\r\n", (double) pitchcompl.coef);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"accel cf: %.6f\r\n", (double) zlpf.alpha);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"pressure cf: %.6f\r\n",
			(double) presslpf.alpha);
		
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"loops count: %d\r\n", loopscount);

		esp_send(&espdev, s);
		
		return 0;
	}
	else if (strcmp(toks[0], "pd") == 0) {
		char s[INFOLEN];
		
		snprintf(s, INFOLEN, "pos PID: %.3f,%.3f,%.3f\r\n",
			(double) p, (double) i, (double) d);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"speed PID: %.3f,%.3f,%.3f\r\n",
			(double) sp, (double) si, (double) sd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"yaw PID: %.3f,%.3f,%.3f\r\n",
			(double) yp, (double) yi, (double) yd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"yaw speed PID: %.3f,%.3f,%.3f\r\n",
			(double) ysp, (double) ysi, (double) ysd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"thrust PID: %.3f,%.3f,%.3f\r\n",
			(double) zsp, (double) zsi, (double) zsd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%s mode\r\n", speedpid ? "single" : "dual");

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%s yaw mode\r\n",
			yawspeedpid ? "single" : "dual");

		esp_send(&espdev, s);
		
