PinkFluffyUnic0rn/stm32flight/main.c
		return 0;
	}
	else if (strcmp(toks[0], "r") == 0) {
		lbw = rbw = ltw = rtw = 0.0;
		return 0;
	}
	else if (strcmp(toks[0], "e") == 0) {
		lbw = rbw = ltw = rtw = 1.0;
		return 0;
	}
	else if (strcmp(toks[0], "dl") == 0) {
		speedpid = 0;
		return 0;
	}
	else if (strcmp(toks[0], "sl") == 0) {
		speedpid = 1;
		return 0;
	}
	else if (strcmp(toks[0], "ydl") == 0) {
		yawspeedpid = 0;
		return 0;
	}
	else if (strcmp(toks[0], "ysl") == 0) {
		yawspeedpid = 1;
		return 0;
	}

	if (tc < 2) {
		esp_send(&espdev, "Unknown command\r\n");
		return (-1);
	}

	if (strcmp(toks[0], "c") == 0) {
		initstabilize(atof(toks[1]));
		return 0;
	}
	else if (strcmp(toks[0], "tt") == 0) {
		thrust = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "pt") == 0) {
		pitchtarget = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "rt") == 0) {
		rolltarget = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "yt") == 0) {
		yawtarget = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "xc") == 0) {
		ax0 = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "yc") == 0) {
		ay0 = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "zc") == 0) {
		az0 = atof(toks[1]);
		return 0;
	}
	else if (strcmp(toks[0], "p") == 0) {
		p = atof(toks[1]);
	
		dsp_setpid(&pitchpv, p, i, d);
		dsp_setpid(&rollpv, p, i, d);
		
		return 0;
	}
	else if (strcmp(toks[0], "i") == 0) {
		i = atof(toks[1]);
		
		dsp_setpid(&pitchpv, p, i, d);
		dsp_setpid(&rollpv, p, i, d);
		
		return 0;
	}
	else if (strcmp(toks[0], "d") == 0) {
		d = atof(toks[1]);
		
		dsp_setpid(&pitchpv, p, i, d);
		dsp_setpid(&rollpv, p, i, d);
		
		return 0;
	}
	else if (strcmp(toks[0], "sp") == 0) {
		sp = atof(toks[1]);
		
		dsp_setpid(&pitchspv, sp, si, sd);
		dsp_setpid(&rollspv, sp, si, sd);
		
		return 0;
	}
	else if (strcmp(toks[0], "si") == 0) {
		si = atof(toks[1]);
		
		dsp_setpid(&pitchspv, sp, si, sd);
		dsp_setpid(&rollspv, sp, si, sd);
		
		return 0;
	}
	else if (strcmp(toks[0], "sd") == 0) {
		sd = atof(toks[1]);
	
		dsp_setpid(&pitchspv, sp, si, sd);
		dsp_setpid(&rollspv, sp, si, sd);
		
		return 0;
	}
	else if (strcmp(toks[0], "yp") == 0) {
		yp = atof(toks[1]);
		
		dsp_setpid(&yawpv, yp, yi, yd);
		
		return 0;
	}
	else if (strcmp(toks[0], "yi") == 0) {
		yi = atof(toks[1]);
		
		dsp_setpid(&yawpv, yp, yi, yd);
		
		return 0;
	}
	else if (strcmp(toks[0], "yd") == 0) {
		yd = atof(toks[1]);
	
		dsp_setpid(&yawpv, yp, yi, yd);
		
		return 0;
	}
	else if (strcmp(toks[0], "ysp") == 0) {
		ysp = atof(toks[1]);
		
		dsp_setpid(&yawspv, ysp, ysi, ysd);
		
		return 0;
	}
	else if (strcmp(toks[0], "ysi") == 0) {
		ysi = atof(toks[1]);
		
		dsp_setpid(&yawspv, ysp, ysi, ysd);
		
		return 0;
	}
	else if (strcmp(toks[0], "ysd") == 0) {
		ysd = atof(toks[1]);
	
		dsp_setpid(&yawspv, ysp, ysi, ysd);
		
		return 0;
	}
	else if (strcmp(toks[0], "tp") == 0) {
		zsp = atof(toks[1]);
		
		dsp_setpid(&zspv, zsp, zsi, zsd);
		
		return 0;
	}
	else if (strcmp(toks[0], "ti") == 0) {
		zsi = atof(toks[1]);
	
		dsp_setpid(&zspv, zsp, zsi, zsd);
		
		return 0;
	}
	else if (strcmp(toks[0], "td") == 0) {
		zsd = atof(toks[1]);
		
		dsp_setpid(&zspv, zsp, zsi, zsd);
		
		return 0;
	}
	else if (strcmp(toks[0], "tc") == 0) {
		tcoef = atof(toks[1]);
	
		dsp_initcompl(&pitchcompl, tcoef, PID_FREQ);
		dsp_initcompl(&rollcompl, tcoef, PID_FREQ);	
		
		return 0;
	}
	else if (strcmp(toks[0], "ptc") == 0) {
		ptcoef = atof(toks[1]);
			
		dsp_initlpf(&presslpf, ptcoef, PID_FREQ);
		
		return 0;
	}	
	else if (strcmp(toks[0], "ztc") == 0) {
		ztcoef = atof(toks[1]);
		
		dsp_initlpf(&zlpf, ztcoef, PID_FREQ);
		
		return 0;
	}

	esp_send(&espdev, "Unknown command\r\n");

	return (-1);
}

int main(void)
{
	int ms;
	int loops;
	int mss;

	HAL_Init();

	systemclock_config();
	
	HAL_Delay(1000);

	gpio_init();
	tim1_init();
	tim2_init();
	dma_init();
	i2c_init();
	spi1_init();
	adc1_init();
	usart1_init();
	usart2_init();
	esc_init();
	bmp_init();
	mpu_init();
	hmc_init();
	espdev_init();

	initstabilize(0.0);

	loops = 0;
	mss = ms = 0;
	wifitimeout = WIFI_TIMEOUT;
	while (1) {
		char cmd[ESP_CMDSIZE];
		int c;

		__HAL_TIM_SET_COUNTER(&htim2, 0);

		if (esp_poll(&espdev, cmd) >= 0)
			controlcmd(cmd);

		if (ms > TICKSPERSEC/PID_FREQ) {
			double dt;

			dt = (float) ms / (float) TICKSPERSEC;

			ms = 0;

			stabilize(dt);
			++loops;
		}

		// every 1 second
		if (mss > TICKSPERSEC/1) {
			if (wifitimeout != 0)
				--wifitimeout;

			if (wifitimeout == 0) {
				char s[INFOLEN];
		
				setthrust(0.0, 0.0, 0.0, 0.0);

				lbw = rbw = ltw = rtw = 0.0;

				snprintf(s, INFOLEN, "wi-fi timed out!\n\r");

				esp_send(&espdev, s);
			}

			loopscount = loops;

			mss = loops = 0;
		}

		c = __HAL_TIM_GET_COUNTER(&htim2);

		ms += c;
		mss += c;
	}

	return 0;
}

void systemclock_config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

	__HAL_RCC_PWR_CLK_ENABLE();
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;

	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
		error_handler();

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK
		| RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1
		| RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct,
			FLASH_LATENCY_0) != HAL_OK)
		error_handler();
}

